![NYC Skyline](nyc.jpg)

Welcome to New York City, one of the most-visited cities in the world. There are many Airbnb listings in New York City to meet the high demand for temporary lodging for travelers, which can be anywhere between a few nights to many months. In this project, we will take a closer look at the New York Airbnb market by combining data from multiple file types like `.csv`, `.tsv`, and `.xlsx`.

Recall that **CSV**, **TSV**, and **Excel** files are three common formats for storing data. 
Three files containing data on 2019 Airbnb listings are available to you:

**data/airbnb_price.csv**
This is a CSV file containing data on Airbnb listing prices and locations.
- **`listing_id`**: unique identifier of listing
- **`price`**: nightly listing price in USD
- **`nbhood_full`**: name of borough and neighborhood where listing is located

**data/airbnb_room_type.xlsx**
This is an Excel file containing data on Airbnb listing descriptions and room types.
- **`listing_id`**: unique identifier of listing
- **`description`**: listing description
- **`room_type`**: Airbnb has three types of rooms: shared rooms, private rooms, and entire homes/apartments

**data/airbnb_last_review.tsv**
This is a TSV file containing data on Airbnb host names and review dates.
- **`listing_id`**: unique identifier of listing
- **`host_name`**: name of listing host
- **`last_review`**: date when the listing was last reviewed

In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.simplefilter('ignore')
price=pd.read_csv('data/airbnb_price.csv')
rtype=pd.read_excel('data/airbnb_room_type.xlsx')
review=pd.read_csv('data/airbnb_last_review.tsv',sep='\t')

## Last and first date of reviews

In [2]:
review.head()

   listing_id    host_name   last_review
0        2595     Jennifer   May 21 2019
1        3831  LisaRoxanne  July 05 2019
2        5099        Chris  June 22 2019
3        5178     Shunichi  June 24 2019
4        5238          Ben  June 09 2019

In [3]:
review['date']=pd.to_datetime(review['last_review'],infer_datetime_format=True,errors='coerce')

In [4]:
minreview=review['date'].min()
maxreview=review['date'].max()
(minreview,maxreview)

(Timestamp('2019-01-01 00:00:00'), Timestamp('2019-07-09 00:00:00'))

## How many are private room types?

In [5]:
rtype.head()

   listing_id                                description        room_type
0        2595                      Skylit Midtown Castle  Entire home/apt
1        3831            Cozy Entire Floor of Brownstone  Entire home/apt
2        5099  Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
3        5178            Large Furnished Room Near B'way     private room
4        5238         Cute & Cozy Lower East Side 1 bdrm  Entire home/apt

In [6]:
rtype['room_type']=rtype['room_type'].str.lower()
rtype['room_type'].value_counts()

room_type
entire home/apt    13266
private room       11356
shared room          587
Name: count, dtype: int64

In [7]:
privatecnt=11356

## Average listing price

In [8]:
price.head()

   listing_id        price                nbhood_full
0        2595  225 dollars         Manhattan, Midtown
1        3831   89 dollars     Brooklyn, Clinton Hill
2        5099  200 dollars     Manhattan, Murray Hill
3        5178   79 dollars  Manhattan, Hell's Kitchen
4        5238  150 dollars       Manhattan, Chinatown

In [9]:
price['act_p']=price['price'].str.replace('dollars','').astype(int)

In [10]:
avg_p=price['act_p'].mean().round(2)
avg_p

141.78

## Final report

In [11]:
review_dates=pd.DataFrame({'first_reviewed':[minreview],'last_reviewed':[maxreview],'nb_private_rooms':[privatecnt],'avg_price':[avg_p]})
review_dates

  first_reviewed last_reviewed  nb_private_rooms  avg_price
0     2019-01-01    2019-07-09             11356     141.78